cmsis-svd/cmsis-svd/data/Renesas/R7FA4W1AD.svd
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>DELSR%s</name>
                    <description>DMAC Event Link Setting Register %s</description>
                    <addressOffset>0x280</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DELS</name>
                            <description>Event selection to DMAC Start request</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x000</name>
                                    <description>Nothing is selected.</description>
                                    <value>0x000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>See Event Table</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SELSR0</name>
                    <description>Snooze Event Link Setting Register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SELS</name>
                            <description>SYS Event Link Select</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x000</name>
                                    <description>Nothing is selected</description>
                                    <value>0x000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x015</name>
                                    <description>DTC_COMPLETE</description>
                                    <value>0x015</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02D</name>
                                    <description>ADC140_WCMPM</description>
                                    <value>0x02D</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02E</name>
                                    <description>ADC140_WCMPUM</description>
                                    <value>0x02E</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x048</name>
                                    <description>CTSU_CTSUFN</description>
                                    <value>0x048</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04A</name>
                                    <description>DOC_DOPCI</description>
                                    <value>0x04A</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B0</name>
                                    <description>SCI0_AM</description>
                                    <value>0x0B0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B1</name>
                                    <description>SCI0_RXI_OR_ERI</description>
                                    <value>0x0B1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Settings  prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
