cmsis-svd/cmsis-svd/data/Renesas/R7FA4W1AD.svd
                <register>
                    <name>PSPMPUEA</name>
                    <description>Process Stack Pointer (PSP) Monitor End Address Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PSPMPUEA</name>
                            <description>Region end address register Address where the region starts, for use in region determination.NOTE: Range: 0x1FF00003-0x200FFFFF         The low-order 2 bits are fixed to 1.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00003</minimum>
                                    <maximum>0x200FFFFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>MMF</name>
            <description>Memory Mirror Function</description>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MMSFR</name>
                    <description>MemMirror Special Function Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>MMSFR Key Code</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xDB</name>
                                    <description>Writing to the MEMMIRADDR bits are valid, when the KEY bits are written 0xDB.</description>
                                    <value>0xDB</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the MEMMIRADDR bits are invalid.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MEMMIRADDR</name>
                            <description>Specifies the memory mirror address.NOTE: A value cannot be set in the low-order 7 bits. These bits are fixed to 0.</description>
                            <lsb>7</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMEN</name>
                    <description>MemMirror Enable Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>MMEN Key Code</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xDB</name>
                                    <description>Writing to the EN bit is valid, when the KEY bits are written 0xDB.</description>
                                    <value>0xDB</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the EN bit is invalid.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000000000000. The write value should be 00000000000000000000000.</description>
                            <lsb>1</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Memory Mirror Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Memory Mirror Function is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Memory Mirror Function is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
