cmsis-svd/cmsis-svd/data/Renesas/R7FA4W1AD.svd
                <register derivedFrom="P200PFS_HA">
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>2-6</dimIndex>
                    <name>P20%sPFS_HA</name>
                    <description>P20%s Pin Function Control Register</description>
                    <alternateRegister>P20%sPFS</alternateRegister>
                    <addressOffset>0x08A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P200PFS_BY">
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>2-6</dimIndex>
                    <name>P20%sPFS_BY</name>
                    <description>P20%s Pin Function Control Register</description>
                    <alternateRegister>P20%sPFS</alternateRegister>
                    <addressOffset>0x08B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P200PFS">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>12-15</dimIndex>
                    <name>P2%sPFS</name>
                    <description>P2%s Pin Function Control Register</description>
                    <addressOffset>0x0B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P200PFS_HA">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>12-15</dimIndex>
                    <name>P2%sPFS_HA</name>
                    <description>P2%s Pin Function Control Register</description>
                    <alternateRegister>P2%sPFS</alternateRegister>
                    <addressOffset>0x0B2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P200PFS_BY">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>12-15</dimIndex>
                    <name>P2%sPFS_BY</name>
                    <description>P2%s Pin Function Control Register</description>
                    <alternateRegister>P2%sPFS</alternateRegister>
                    <addressOffset>0x0B3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P108PFS">
                    <name>P300PFS</name>
                    <description>P300 Pin Function Control Register</description>
                    <addressOffset>0x0C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010010</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P108PFS_HA">
                    <name>P300PFS_HA</name>
                    <description>P300 Pin Function Control Register</description>
                    <alternateRegister>P300PFS</alternateRegister>
                    <addressOffset>0x0C2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0010</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P108PFS_BY">
                    <name>P300PFS_BY</name>
                    <description>P300 Pin Function Control Register</description>
                    <alternateRegister>P300PFS</alternateRegister>
                    <addressOffset>0x0C3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS</name>
                    <description>P30%s Pin Function Control Register</description>
                    <addressOffset>0x0C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS_HA</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P30%sPFS</alternateRegister>
                    <addressOffset>0x0C6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS_BY</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P30%sPFS</alternateRegister>
                    <addressOffset>0x0C7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
