cmsis-svd/cmsis-svd/data/Renesas/R7FA4W1AD.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CRC</name>
            <description>CRC Calculator</description>
            <baseAddress>0x40074000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CRCCR0</name>
                    <description>CRC Control Register0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DORCIR</name>
                            <description>CRCDOR Register Clear</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clears the CRCDOR register.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LMS</name>
                            <description>CRC Calculation Switching</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generates CRC for LSB first communication.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Generates CRC for MSB first communication.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>3</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPS</name>
                            <description>CRC Generating Polynomial Switching</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>No calculation is executed.</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>8-bit CRC-8 (X8 + X2 + X + 1)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>16-bit CRC-16 (X16 + X15 + X2 + 1)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>16-bit CRC-CCITT (X16 + X12 + X5 + 1)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>32-bit CRC-32 (X32+X26+X23+X22+X16+X12+X11+X10+X8+X7+X5+X4+X2+X+1)</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>32-bit CRC-32C (X32+X28+X27+X26+ X25+X23+X22+X20+X19+X18+X14+X13+X11+X10+X9+X8+X6+1)</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>No calculation is executed.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCCR1</name>
                    <description>CRC Control Register1</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCSEN</name>
                            <description>Snoop enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CRCSWR</name>
                            <description>Snoop-on-write/read switch bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Snoop-on-read</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Snoop-on-write</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCDIR</name>
                    <description>CRC Data Input Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCDIR</name>
                            <description>Calculation input Data (Case of CRC-32, CRC-32C )</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCDIR_BY</name>
                    <description>CRC Data Input Register (byte access)</description>
                    <alternateRegister>CRCDIR</alternateRegister>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCDIR_BY</name>
                            <description>Calculation input Data ( Case of CRC-8, CRC-16 or CRC-CCITT )</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCDOR</name>
                    <description>CRC Data Output Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCDOR</name>
                            <description>Calculation output Data (Case of CRC-32, CRC-32C )</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCDOR_HA</name>
                    <description>CRC Data Output Register (halfword access)</description>
                    <alternateRegister>CRCDOR</alternateRegister>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCDOR_HA</name>
                            <description>Calculation output Data (Case of CRC-16 or CRC-CCITT )</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCDOR_BY</name>
                    <description>CRC Data Output Register(byte access)</description>
                    <alternateRegister>CRCDOR</alternateRegister>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCDOR_BY</name>
                            <description>Calculation output Data (Case of CRC-8 )</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCSAR</name>
                    <description>Snoop Address Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRCSA</name>
                            <description>snoop address bitSet the I/O register address to snoop</description>
                            <lsb>0</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0003</name>
                                    <description>SCI0.TDR</description>
                                    <value>0x0003</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0005</name>
                                    <description>SCI0.RDR</description>
                                    <value>0x0005</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0023</name>
                                    <description>SCI1.TDR</description>
                                    <value>0x0023</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0025</name>
                                    <description>SCI1.RDR</description>
                                    <value>0x0025</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0043</name>
                                    <description>SCI2.TDR</description>
                                    <value>0x0043</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0045</name>
                                    <description>SCI2.RDR</description>
                                    <value>0x0045</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0063</name>
                                    <description>SCI3.TDR</description>
                                    <value>0x0063</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0065</name>
                                    <description>SCI3.RDR</description>
                                    <value>0x0065</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0083</name>
                                    <description>SCI4.TDR</description>
                                    <value>0x0083</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0085</name>
                                    <description>SCI4.RDR</description>
                                    <value>0x0085</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0123</name>
                                    <description>SCI9.TDR</description>
                                    <value>0x0123</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0125</name>
                                    <description>SCI9.RDR</description>
                                    <value>0x0125</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Settings other than above are prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
